Extensions/FortMonitorAPI_ТЛЭ/Catalogs/уатУчетныеЗаписиСистемыМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уатУчетныеЗаписиСистемыМониторинга</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСистемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВерсииАвтоГРАФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_БезЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ИмяПараметраСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Catalogs/уатУчетныеЗаписиСистемыМониторинга/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
&После("УстановитьВидимость")
Процедура SDL_УстановитьВидимость()
	
	Если ЭтоФортМонитор Тогда 
		
		Элементы.СпособРаботы.Видимость			 = Ложь;
		Элементы.СпособПодключения.Видимость	 = Ложь;
		Элементы.Логин.Видимость				 = Истина;
		Элементы.Пароль.Видимость				 = Истина;
		Элементы.АдресСервиса.Видимость			 = Истина;
		Элементы.Сервер.Видимость				 = Ложь;
		Элементы.ИмяБД.Видимость				 = Ложь;
		Элементы.Драйвер.Видимость				 = Ложь;
		Элементы.ИмяPIPE.Видимость				 = Ложь;
		Элементы.ИмяDSN.Видимость				 = Ложь;
		Элементы.ИмяDSN.Видимость				 = Ложь;
		Элементы.ГруппаТокен.Видимость			 = Истина;
		Элементы.ГруппаПолучитьТокен.Видимость 	= Ложь;
		Элементы.Ресурс.Видимость				 = Ложь;
		Элементы.ВидСистемы.Видимость			 = Ложь;
		Элементы.Версия.Видимость				 = Ложь;
		Элементы.ГруппаПроверитьПодключение.Видимость	 = Истина;
		Элементы.СпособРеализацииВебСервиса.Видимость	 = Ложь;
		//Элементы.ГруппаПредупреждение.Видимость	 = Истина;

	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура SDL_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	скПортИЗащищенноеСоединение();
	ЭтоФортМонитор = SDL_ФортМонитор.ЭтоСистемаМониторингаФортМонитор(Объект.СистемаМониторинга); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура SDL_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновленТокенАвторизации" 
		И Источник = ЭтотОбъект Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура скПортИЗащищенноеСоединение()
	
	Если НЕ ЗначениеЗаполнено(Объект.SDL_Порт) Тогда
	        Объект.SDL_Порт = 443;
			ЭтотОбъект.Записать();
	КонецЕсли;
	
	ИмяГруппыРодитель = "ОсновнаяГруппа"; 
	ИмяГруппыПеред = "Логин";
	ГруппаРодитель = Элементы.Найти(ИмяГруппыРодитель); 
	ГруппаПеред = Элементы.Найти(ИмяГруппыПеред); 
	Если ГруппаРодитель <> Неопределено И ГруппаПеред <> Неопределено Тогда 
	
		НоваяГруппа = Элементы.Вставить("ГруппаSDL_ПортSDL_БезЗащиты",тип("ГруппаФормы"),ГруппаРодитель,ГруппаПеред);
		НоваяГруппа.Вид=ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		НоваяГруппа.ОтображатьЗаголовок  = Ложь;  
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		
	    ИмяНовогоЭлемента = "SDL_Порт";
		НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента,Тип("ПолеФормы"),НоваяГруппа);
		НовыйЭлемент.Вид=ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Порт";
		НовыйЭлемент.ПутьКДанным = "Объект." + ИмяНовогоЭлемента;   
		
	    ИмяНовогоЭлемента = "SDL_БезЗащиты";
		НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента,Тип("ПолеФормы"),НоваяГруппа);
		НовыйЭлемент.Вид=ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.Заголовок = "Соединение без защиты";
		НовыйЭлемент.ПутьКДанным = "Объект." + ИмяНовогоЭлемента;
		
	
	КонецЕсли;
	
	
КонецПроцедуры // скПортИЗащищенноеСоединение()
